#+title: Release Notes for Sprint 32
#+options: date:nil toc:nil author:nil num:nil
#+todo: ANALYSIS IMPLEMENTATION TESTING | COMPLETED CANCELLED
#+tags: story(s) epic(e) task(t) note(n) spike(p)

* Release Notes

This file contains all stories that were closed during sprint 32.

** Development Stories Implemented

#+begin: clocktable :maxlevel 3 :scope subtree
Clock summary at [2013-08-07 Wed 20:10]

| Headline                                                              | Time   |      |      |
|-----------------------------------------------------------------------+--------+------+------|
| *Total time*                                                          | *5:09* |      |      |
|-----------------------------------------------------------------------+--------+------+------|
| Development Stories Implemented                                       |        | 5:09 |      |
| IMPLEMENTATION Release notes and backlog grooming                     |        |      | 0:26 |
| COMPLETED Split transformation code from C++ model into its own model |        |      | 2:57 |
| IMPLEMENTATION Create a formatting workflow in C++ formatters model   |        |      | 1:46 |
#+end:

*** IMPLEMENTATION Release notes and backlog grooming                  :task:
    CLOCK: [2013-08-05 Mon 23:24]--[2013-08-05 Mon 23:31] =>  0:07
    CLOCK: [2013-08-05 Mon 23:05]--[2013-08-05 Mon 23:24] =>  0:19

*** COMPLETED Split formatting code from C++ model into its own model :story:
    CLOSED: [2013-08-05 Mon 23:27]

The =cpp_formatters= model is responsible for taking a C++
representation and writing it to file.

*** COMPLETED Split transformation code from C++ model into its own model :story:
    CLOSED: [2013-08-06 Tue 22:58]
    CLOCK: [2013-08-06 Tue 22:13]--[2013-08-06 Tue 22:57] =>  0:44
    CLOCK: [2013-08-06 Tue 21:55]--[2013-08-06 Tue 22:13] =>  0:18
    CLOCK: [2013-08-06 Tue 18:14]--[2013-08-06 Tue 18:40] =>  0:26
    CLOCK: [2013-08-06 Tue 17:56]--[2013-08-06 Tue 18:08] =>  0:12
    CLOCK: [2013-08-06 Tue 08:24]--[2013-08-06 Tue 08:37] =>  0:13
    CLOCK: [2013-08-06 Tue 07:46]--[2013-08-06 Tue 08:18] =>  0:32
    CLOCK: [2013-08-05 Mon 23:24]--[2013-08-05 Mon 23:56] =>  0:32

The SML to C++ transformer is responsible for taking an SML
representation of a model and converting it to the C++ equivalent;
this is =sml_to_cpp=, since its a unidirectional transformation. It
would takes a lot of classes such as locator, includer, etc;

*** COMPLETED Create a transformation workflow in C++ transformation model :story:
    CLOSED: [2013-08-06 Tue 22:58]
*** IMPLEMENTATION Create a formatting workflow in C++ formatters model :story:
    CLOCK: [2013-08-07 Wed 19:01]--[2013-08-07 Wed 19:30] =>  0:29
    CLOCK: [2013-08-07 Wed 08:28]--[2013-08-07 Wed 08:34] =>  0:06
    CLOCK: [2013-08-07 Wed 07:47]--[2013-08-07 Wed 08:18] =>  0:31
    CLOCK: [2013-08-06 Tue 22:59]--[2013-08-06 Tue 23:39] =>  0:40

** Deprecated Development Stories
